Documents/ЛБ_РегламентноеНачислениеПроцентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РегламентноеНачислениеПроцентов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентамиБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаРасчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентамиБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентамиБУ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроцентам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОсновномуДолгу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РегламентноеНачислениеПроцентов/Ext/ObjectModule.bsl
Функция СоздатьНовуюОплатуПроцентов(ЗалоговыйБилет)
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	ДокументОбъект.Дата = ЭтотОбъект.Дата; 
	ДокументОбъект.Организация = ЭтотОбъект.Организация;
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема;  
	Возврат ДокументОбъект; 
КонецФункции
	   
	   
 ////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью".
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	СписокСтатусовЗБ = Новый СписокЗначений;
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен); 
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен);
    СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство);
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную);  
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг); 
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен);  
	Запрос.УстановитьПараметр("СтатусыЗБ", СписокСтатусовЗБ); 
	Если ЭтотОбъект.Ломбарды.Количество() = 0 Тогда 
		ОтборПоЛомбардам = Ложь;
	Иначе  
		ОтборПоЛомбардам = Истина; 
		Запрос.УстановитьПараметр("Ломбарды", ЭтотОбъект.Ломбарды.ВыгрузитьКолонку("Ломбард"));
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет.Организация = &Организация"; 
	Если  ОтборПоЛомбардам Тогда  
		Запрос.Текст = Запрос.Текст + "
	               |				И ЗалоговыйБилет.Ломбард В (&Ломбарды)";  
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст + ") КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета В (&СтатусыЗБ)";
	 
	ТаблицаЗБ = Запрос.Выполнить().Выгрузить(); 
	УдСтроки = Новый СписокЗначений;
	
	ЗапросИзъятие = Новый Запрос;
	ЗапросИзъятие.УстановитьПараметр("Дата", ЭтотОбъект.Дата);      
	ЗапросИзъятие.УстановитьПараметр("ЗБ", ТаблицаЗБ.ВыгрузитьКолонку("ЗалоговыйБилет"));
	ЗапросИзъятие.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ЗалоговыйБилет
	                      |ИЗ
	                      |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	                      |ГДЕ
	                      |	(ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Изъят)
	                      |			ИЛИ ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Остановлен)
	                      |				И ЛБ_СостояниеЗалоговогоБилета.Период < &Дата
	                      |				И ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет В (&ЗБ))";
    ВыборкаИзътие = ЗапросИзъятие.Выполнить().Выбрать();
	Пока ВыборкаИзътие.Следующий() Цикл  
		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", ВыборкаИзътие.ЗалоговыйБилет);
		Строки = ТаблицаЗБ.НайтиСтроки(Отбор); 
		Если НЕ Строки.Количество() = 0 Тогда 
			УдСтроки.Добавить(Строки.Получить(0));
		КонецЕсли;	
	Конеццикла;	
	
	Для каждого Эл Из УдСтроки Цикл 
		ТаблицаЗБ.Удалить(Эл.Значение);
	Конеццикла;	
	
	Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
	Если НЕ ТаблицаЗБ.Количество() = 0 Тогда    
		ЗапросРасчеты = Новый Запрос;  
		ЗапросРасчеты.УстановитьПараметр("ЗалоговыеБилеты", ТаблицаЗБ.ВыгрузитьКолонку("ЗалоговыйБилет"));
		ЗапросРасчеты.УстановитьПараметр("Организация", ЭтотОбъект.Организация); 
		ЗапросРасчеты.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		ЗапросРасчеты.Текст = "ВЫБРАТЬ
		                      |	ЛБ_РасчетыСКлиентамиБУ.Регистратор КАК Регистратор,
		                      |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет КАК ЗалоговыйБилет,
		                      |	ЛБ_РасчетыСКлиентамиБУ.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
		                      |	ЛБ_РасчетыСКлиентамиБУ.Сумма КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ КАК ЛБ_РасчетыСКлиентамиБУ
		                      |ГДЕ
		                      |	ЛБ_РасчетыСКлиентамиБУ.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет В(&ЗалоговыеБилеты)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.Организация = &Организация
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.Период < &Дата
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ЛБ_РасчетыСКлиентамиБУ.Период УБЫВ";
		ТаблицаРасчетов = ЗапросРасчеты.Выполнить().Выгрузить();
				
		Для каждого стр Из  ТаблицаЗБ Цикл    
			СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(Стр.ЗалоговыйБилет.Дата, стр.ЗалоговыйБилет.Организация);
			Если НЕ СтруктураП = неопределено Тогда
			    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
				ПредельноеЗначениеПроцентов = Стр.ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
			Иначе
				ПредельноеЗначениеПроцентов = 0;
			КонецЕсли;   
			СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(Стр.ЗалоговыйБилет);
			Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(Стр.ЗалоговыйБилет); 
			ДокументОплатыПроцентов = СоздатьНовуюОплатуПроцентов(Стр.ЗалоговыйБилет);
			ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(ДокументОплатыПроцентов, Стр.ЗалоговыйБилет);
			Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОплатыПроцентов, Стр.ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр); 
			
			Если Результат.СуммаПроцентов = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			СуммаНачислено = 0;
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ДатаНачалаРасчета", Стр.ДатаНачалаРасчета);  
			
			СуммаОтмены = 0;
			СтрокиР = ТаблицаРасчетов.НайтиСтроки(Отбор);  
			Для каждого стрР Из СтрокиР Цикл  
				Если НЕ ТипЗнч(СтрР.Регистратор) = Тип("ДокументСсылка.ЛБ_РегламентноеНачислениеПроцентов") Тогда 
					Если СтрР.Сумма < 0 Тогда //отмена 
						СуммаОтмены = СтрР.Сумма;
						Продолжить;
					ИначеЕсли (СтрР.Сумма + СуммаОтмены) = 0 Тогда 
						СуммаОтмены = 0;
						Продолжить;
					Иначе	
					    Прервать;
					КонецЕсли;	
				КонецЕсли;	
				СуммаНачислено  = СуммаНачислено + стрР.Сумма;  
			Конеццикла;		
			
			СуммаПроцентовОстаток = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ДокументОплатыПроцентов, Стр.ЗалоговыйБилет);
			СуммаПроцентов = Результат.СуммаПроцентов - СуммаНачислено - СуммаПроцентовОстаток;
			Если НЕ СуммаПроцентов = 0 Тогда
				Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
				Движение.Период = Дата;     
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Организация = Организация; 
				Движение.Ломбард = Стр.ЗалоговыйБилет.Ломбард;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = Стр.ЗалоговыйБилет.Залогодатель;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;				
				Движение.ДатаНачалаРасчета = Стр.ДатаНачалаРасчета;		
				Движение.Сумма = СуммаПроцентов;     
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
